_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_41 (Conv2D)           (None, 128, 128, 32)      896       
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 128, 128, 32)      9248      
_________________________________________________________________
max_pooling2d_21 (MaxPooling (None, 64, 64, 32)        0         
_________________________________________________________________
conv2d_43 (Conv2D)           (None, 64, 64, 64)        18496     
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 64, 64, 64)        36928     
_________________________________________________________________
max_pooling2d_22 (MaxPooling (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 32, 32, 128)       73856     
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 32, 32, 128)       147584    
_________________________________________________________________
max_pooling2d_23 (MaxPooling (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 16, 16, 256)       295168    
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 16, 16, 256)       590080    
_________________________________________________________________
max_pooling2d_24 (MaxPooling (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 16384)             0         
_________________________________________________________________
dense_16 (Dense)             (None, 256)               4194560   
_________________________________________________________________
dropout_11 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_12 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_6 (Activation)    (None, 1)                 0         
=================================================================
Total params: 5,432,865
Trainable params: 5,432,865
Non-trainable params: 0
_________________________________________________________________
